Revit 2024 API
MEPSize.OuterDiameter Property
 Outer diameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double OuterDiameter { get; }
Visual Basic
Public ReadOnly Property OuterDiameter As Double
	Get
Visual C++
public:
property double OuterDiameter {
	double get ();
}
See Also
MEPSize Class
Autodesk.Revit.DB Namespace